[
  {
    "author": "Charmaine Hines",
    "date": "2 weeks ago",
    "rating": 5,
    "text": "Borges Roofing did a good job with our new roof. Color took a little longer than expected, but in the end we are glad we waited. Love it. His crew were very respectful and worked well.",
    "ownerReply": "Thank you for your review! We’re glad to hear you love your new roof. We appreciate your patience with the color delay, we're happy it was worth the wait in the end. Our crew works hard to be respectful and efficient, and it’s great to know their efforts showed. If you ever need anything in the future, we’re here to help. Thanks again for choosing Borges Roofing!",
    "source": "Google"
  },
  {
    "author": "Ernesto Mosquera",
    "date": "2 months ago",
    "rating": 5,
    "text": "Borges Roofing saved the day! I had a water leak and needed roof repair fast. They were very responsive, professional, and had the issue fixed quickly and thoroughly. The quality of the work is outstanding, and they took the time to explain everything clearly. I couldn’t be happier, I highly recommend Borges Roofing!",
    "ownerReply": "Thank you so much for your kind words! We value your business.",
    "source": "Google"
  },
  {
    "author": "Britney Ruiz",
    "date": "2 months ago",
    "rating": 5,
    "text": "Borges Roofing, Inc. did an excellent job on my roof! They were quick, reliable, and very detailed in their work. The team showed up on time, worked efficiently, and completed everything sooner than I expected without cutting corners.",
    "ownerReply": "Thank you for the opportunity to serve you and for trusting us with your roofing needs.",
    "source": "Google"
  },
  {
    "author": "Orla Davis",
    "date": "4 months ago",
    "rating": 5,
    "text": "I couldn't be happier with the exceptional service I received from Borges Roofing Service! From start to finish, the experience was professional, efficient, and above all—honest. Special shoutout to George, who went above and beyond to fix the issue.",
    "source": "Google"
  },
  {
    "author": "Farida Waquad",
    "date": "4 weeks ago",
    "rating": 5,
    "text": "George is very honest and efficient. The work was done very professionally. George is 100% trustworthy to keep his promises. Very friendly to work with. I would recommend George to our friends and family.",
    "ownerReply": "Thank you so much for taking the time to share your experience. We truly appreciate your support.",
    "source": "Google"
  },
  {
    "author": "Jose Lim",
    "date": "4 months ago",
    "rating": 5,
    "text": "I personally want to thank so much George and Francisco of Borges Roofing Inc for the great and professional services they showed me in fixing my roof leak. George was very helpful and honest finding the problem and giving me the cost.",
    "source": "Google"
  },
  {
    "author": "Tiffany Fernandez",
    "date": "3 months ago",
    "rating": 5,
    "text": "I couldn’t be happier with the work this roofing company did on my home! From start to finish, they were incredibly professional, on time, and respectful of my property.",
    "source": "Google"
  },
  {
    "author": "Mimi g",
    "date": "5 months ago",
    "rating": 5,
    "text": "I recently contracted Borges Roofing to replace my townhouse flat roof in Miami Lakes. During replacement we encountered previous code violations & issues that were promptly addressed & resolved by George, the owner. I'm thankful for the thorough work.",
    "source": "Google"
  },
  {
    "author": "Zulkifli Darojat",
    "date": "1 year ago",
    "rating": 5,
    "text": "Very easy company to work with. George explained everything he planned on doing for a shingle reroof and got it done. He handled all the permits and His team was very professional. My tenants and I had no issues during the whole process.",
    "source": "Google"
  },
  {
    "author": "Nathan Tice",
    "date": "3 months ago",
    "rating": 5,
    "text": "We had our roof done - I hadn't imagined that it'd be so pretty. It is beautiful... We went for metal, and although it took some time, we're glad we did it. It really improved the look and cools down our house.",
    "ownerReply": "Thank you so much for your kind words! Customers like you truly make a difference and help others trust in what we do.",
    "source": "Google"
  },
  {
    "author": "Joanna Navarro",
    "date": "9 months ago",
    "rating": 5,
    "text": "I had been shopping around for a good roofing company for almost 6 months. Borges Roofing was a recommendation of a friend. I can’t express enough what a great experience this was. My calls and messages were always answered timely.",
    "source": "Google"
  },
  {
    "author": "unimog 61",
    "date": "10 months ago",
    "rating": 5,
    "text": "Extremely happy with my new roof by Borges Roofing! George repaired my roof several times over the years and after each time, advised me of the impending need to re roof! Well, after 27 years that day came and they did a beautiful job on my roof.",
    "source": "Google"
  },
  {
    "author": "Rick Padron",
    "date": "10 months ago",
    "rating": 5,
    "text": "Just had my roof done by Borges Roofing . Wanted to say I was very pleased and satisfied with his quality of work and professionalism.",
    "source": "Google"
  },
  {
    "author": "Sonnia Bequer",
    "date": "9 months ago",
    "rating": 5,
    "text": "I recently had a new roof installed by Borges Roofing, and I couldn't be happier with their service. From the moment I contacted them, their customer service was exceptional.",
    "source": "Google"
  },
  {
    "author": "Michele Molina",
    "date": "10 months ago",
    "rating": 5,
    "text": "Had a great experience with Borges roofing. All steps of the process were explained from start to finish. The paper work that the HOA requested and the City of Pembroke Pines was all done by the company on a timely matter.",
    "source": "Google"
  },
  {
    "author": "Max Lobaina",
    "date": "10 months ago",
    "rating": 5,
    "text": "Borges Roofing !! Best roofing company out there ! The owner George is honest, reliable, trustworthy and very professional. George and team were here on time as promised and did an outstanding job on my roof repairs and my neighbors also.",
    "source": "Google"
  },
  {
    "author": "magalys molina",
    "date": "1 year ago",
    "rating": 5,
    "text": "I was recently able to replace the roof of my house with the company Borges Roofing Inc. Who met all my expectations. I am very satisfied with the quality of the roof, responsibility, punctuality and for leaving everything in order and clean.",
    "source": "Google"
  },
  {
    "author": "Tarali Pena",
    "date": "1 year ago",
    "rating": 5,
    "text": "I had a wonderful experience with Borges Roofing. They are honest, reliable and dependable. After working in the construction industry for two decades and as a homeowner, I know how difficult that is to find. Not only is Borges Roofing great at what they do, they also do it with integrity.",
    "source": "Google"
  },
  {
    "author": "Santiago Sellan",
    "date": "10 months ago",
    "rating": 5,
    "text": "I cannot recommend this contractor enough. From the very beginning during the quotation process, George was thorough, knowledgeable, and most importantly, HONEST about my project.",
    "source": "Google"
  },
  {
    "author": "Chris Hernandez",
    "date": "1 year ago",
    "rating": 5,
    "text": "Borges roofing was excellent. The roof looks great! They went the extra mile with all my asks. We had a possible hurricane heading our way and they made sure to clear the roof of all debris and uninstalled tile to make sure we were safe. Highly recommend",
    "source": "Google"
  },
  {
    "author": "Christina B",
    "date": "4 months ago",
    "rating": 5,
    "text": "Just wanted to say how great the service was, super professional, friendly, and everything was done really well. I’m really happy with how it all turned out and would definitely recommend the company to anyone looking for quality and reliability. Thanks again!",
    "source": "Google"
  },
  {
    "author": "Milaida Hernandez",
    "date": "2 years ago",
    "rating": 5,
    "text": "I had a wonderful experience with Borges Roofing. They arrived on time for my estimate and were here the next day to get started. My roof was repaired the same day and it looks amazing. I will recommend this company to everyone and anyone.",
    "source": "Google"
  },
  {
    "author": "javier pacheco",
    "date": "8 months ago",
    "rating": 5,
    "text": "In these times we live in now and so many programs 100percent financing to do the whole roof you could be in a hole of 40k to 50k and here comes Borges roofing when all the others want a home run George Borges looks out for the little ppl.",
    "source": "Google"
  },
  {
    "author": "Michelle Walsh",
    "date": "2 years ago",
    "rating": 5,
    "text": "I was desperate for somebody honest that would finally explain to me why there was moisture in my walls from a previous leak. I had to write this review because it is so rare in this town to find somebody that will (a) show up, (b) tell you exactly what is happening, and (c) fix it properly. Thank you Borges Roofing.",
    "source": "Google"
  },
  {
    "author": "Susan Hernandez",
    "date": "4 months ago",
    "rating": 5,
    "text": "Great job! Prompt service, very reliable, and very knowledgeable… I’ll surely recommend him to friends.",
    "source": "Google"
  },
  {
    "author": "Jr Garcia",
    "date": "10 months ago",
    "rating": 5,
    "text": "Exceptional service from start to finish! The team at Borges roofing went above and beyond to ensure my roof was repaired with the highest level of craftsmanship.",
    "source": "Google"
  },
  {
    "author": "Raul Jaime",
    "date": "2 years ago",
    "rating": 5,
    "text": "Very professional roofing company and reliable. The work was completed in a timely manner, and I am very satisfied with the finished product. I would recommend this roofing company.",
    "source": "Google"
  },
  {
    "author": "Gertrudis Rodriguez",
    "date": "10 months ago",
    "rating": 5,
    "text": "Excellent job, profesional and fast, thank you Borges and your team!",
    "source": "Google"
  },
  {
    "author": "jonathan ferro",
    "date": "1 day ago",
    "rating": 5,
    "text": "I couldn’t be happier with the work done by Borges Roofing. From start to finish, the experience was smooth, professional, and stress-free. Their team showed up on time, walked me through everything clearly, and delivered exactly what they promised.",
    "source": "Google"
  },
  {
    "author": "Fernando Salinas",
    "date": "2 years ago",
    "rating": 5,
    "text": "I contacted Borges Roofing Inc. to replace my roof and received a prompt response from the owner himself. They were very courteous, gave me a quick estimate, and started the job on time. In fact, I didn't have to wait weeks for the work to begin.",
    "source": "Google"
  }
]
